Revit 2024 API
Panel.FromRoom Property
The "From Room" set for the door or window.
Overload List
Name | Description
FromRoom
The "From Room" set for the door or window in the last phase of the project.
 (Inherited from FamilyInstance.)
FromRoom[Phase] |  (Inherited from FamilyInstance.)
See Also
Panel Class
Panel Members
Autodesk.Revit.DB Namespace